In [1]:
import pandas as pd

In [2]:
Nama_reptil=['Buaya','Aligator','Ular','Kadal','Kura-kura']

In [3]:
ds=pd.Series(Nama_reptil)

In [4]:
ds

0        Buaya
1     Aligator
2         Ular
3        Kadal
4    Kura-kura
dtype: object

In [5]:
type(ds)

pandas.core.series.Series

In [6]:
ds=pd.Series(Nama_reptil, index=['a','b','c','d','e'])

In [7]:
ds

a        Buaya
b     Aligator
c         Ular
d        Kadal
e    Kura-kura
dtype: object

In [8]:
ds.values

array(['Buaya', 'Aligator', 'Ular', 'Kadal', 'Kura-kura'], dtype=object)

In [9]:
ds.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
ds[0]

'Buaya'

In [11]:
ds['a']

'Buaya'

In [12]:
ds[0]==ds['a']

True

In [13]:
ds[0:2]

a       Buaya
b    Aligator
dtype: object

In [14]:
ds[['a','b']]

a       Buaya
b    Aligator
dtype: object

In [15]:
ds[['a','c']]

a    Buaya
c     Ular
dtype: object

In [16]:
ds[-1]

'Kura-kura'

In [17]:
ds[-1]==ds['e']

True

In [18]:
var2={'Nama':'Aghniya',
     'Umur':21,
     'Kota':'Bandung'}

In [19]:
type(var2)

dict

In [20]:
cv=pd.Series(var2)

In [21]:
cv

Nama    Aghniya
Umur         21
Kota    Bandung
dtype: object

In [22]:
cv.index

Index(['Nama', 'Umur', 'Kota'], dtype='object')

In [23]:
cv.values

array(['Aghniya', 21, 'Bandung'], dtype=object)

In [24]:
cv['Nama']

'Aghniya'

In [25]:
print("Ganti Identitas")
for i in cv.index:
    print(i, end='=')
    cv[i]=str(input('Masukan Identitas='))

Ganti Identitas
Nama=Masukan Identitas=Aghniya
Umur=Masukan Identitas=21
Kota=Masukan Identitas=Bandung

In [26]:
cv

Nama    Aghniya
Umur         21
Kota    Bandung
dtype: object

## Data Frame

In [27]:
Ular={'Nama':['Anaconda','Sanca','Boa','Kobra','Beludak','Tambang'],
     'Panjang':[4,5,5,4,7,8],
     'Bobot (Kg)':[15,20,27,14,20,21]}

In [28]:
type(Ular)

dict

In [29]:
len(Ular)

3

In [30]:
df=pd.DataFrame(Ular)

In [31]:
df

       Nama  Panjang  Bobot (Kg)
0  Anaconda        4          15
1     Sanca        5          20
2       Boa        5          27
3     Kobra        4          14
4   Beludak        7          20
5   Tambang        8          21

In [32]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [33]:
df.values

array([['Anaconda', 4, 15],
       ['Sanca', 5, 20],
       ['Boa', 5, 27],
       ['Kobra', 4, 14],
       ['Beludak', 7, 20],
       ['Tambang', 8, 21]], dtype=object)

In [34]:
df.columns

Index(['Nama', 'Panjang', 'Bobot (Kg)'], dtype='object')

In [35]:
df['Nama']

0    Anaconda
1       Sanca
2         Boa
3       Kobra
4     Beludak
5     Tambang
Name: Nama, dtype: object

In [36]:
df['Bobot (Kg)']

0    15
1    20
2    27
3    14
4    20
5    21
Name: Bobot (Kg), dtype: int64

In [37]:
df['Nama'].loc[0]

'Anaconda'

In [38]:
df

       Nama  Panjang  Bobot (Kg)
0  Anaconda        4          15
1     Sanca        5          20
2       Boa        5          27
3     Kobra        4          14
4   Beludak        7          20
5   Tambang        8          21

In [39]:
df.loc[0]

Nama          Anaconda
Panjang              4
Bobot (Kg)          15
Name: 0, dtype: object

In [40]:
df.iloc[-1]

Nama          Tambang
Panjang             8
Bobot (Kg)         21
Name: 5, dtype: object

## Modifikasi-Tambah-Hapus

In [41]:
df.at[0,'Nama']='Laba-laba'

In [42]:
df

        Nama  Panjang  Bobot (Kg)
0  Laba-laba        4          15
1      Sanca        5          20
2        Boa        5          27
3      Kobra        4          14
4    Beludak        7          20
5    Tambang        8          21

In [43]:
df.at[3,'Panjang']=10

In [44]:
df

        Nama  Panjang  Bobot (Kg)
0  Laba-laba        4          15
1      Sanca        5          20
2        Boa        5          27
3      Kobra       10          14
4    Beludak        7          20
5    Tambang        8          21

In [45]:
df['Status Bahaya']=[5,4,3,2,5,1]

In [46]:
df

        Nama  Panjang  Bobot (Kg)  Status Bahaya
0  Laba-laba        4          15              5
1      Sanca        5          20              4
2        Boa        5          27              3
3      Kobra       10          14              2
4    Beludak        7          20              5
5    Tambang        8          21              1

In [47]:
df.columns

Index(['Nama', 'Panjang', 'Bobot (Kg)', 'Status Bahaya'], dtype='object')

In [59]:
var1={'Nama':'Kawat',
     'Panjang':10,
     'Bobot (Kg)':5,
     'Status Bahaya':10}

In [60]:
type(var1)

dict

In [61]:
df=df.append(var1, ignore_index=True)

C:\Users\user\AppData\Local\Temp\ipykernel_3596\1527821462.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(var1, ignore_index=True)

In [62]:
df

         Nama  Panjang  Bobot (Kg)  Status Bahaya
0   Laba-laba        4          15              5
1       Sanca        5          20              4
2         Boa        5          27              3
3       Kobra       10          14              2
4     Beludak        7          20              5
5     Tambang        8          21              1
6       Kawat       10           5             10
7       Kawat       10           5             10
8       Kawat       10           5             10
9       Kawat       10           5             10
10      Kawat       10           5             10

### Penambahan data tanpa identitas kolom

In [63]:
var2=['Siput',3,5,1]
df.loc[len(df)]=var2

In [64]:
df

         Nama  Panjang  Bobot (Kg)  Status Bahaya
0   Laba-laba        4          15              5
1       Sanca        5          20              4
2         Boa        5          27              3
3       Kobra       10          14              2
4     Beludak        7          20              5
5     Tambang        8          21              1
6       Kawat       10           5             10
7       Kawat       10           5             10
8       Kawat       10           5             10
9       Kawat       10           5             10
10      Kawat       10           5             10
11      Siput        3           5              1

In [65]:
len(df)

12

In [66]:
var3=['Laba-laba',1,0.5,0]

In [67]:
len(df)

12

In [68]:
df

         Nama  Panjang  Bobot (Kg)  Status Bahaya
0   Laba-laba        4          15              5
1       Sanca        5          20              4
2         Boa        5          27              3
3       Kobra       10          14              2
4     Beludak        7          20              5
5     Tambang        8          21              1
6       Kawat       10           5             10
7       Kawat       10           5             10
8       Kawat       10           5             10
9       Kawat       10           5             10
10      Kawat       10           5             10
11      Siput        3           5              1

In [69]:
df.loc[len(df)]=var3

In [70]:
df

         Nama  Panjang  Bobot (Kg)  Status Bahaya
0   Laba-laba        4        15.0              5
1       Sanca        5        20.0              4
2         Boa        5        27.0              3
3       Kobra       10        14.0              2
4     Beludak        7        20.0              5
5     Tambang        8        21.0              1
6       Kawat       10         5.0             10
7       Kawat       10         5.0             10
8       Kawat       10         5.0             10
9       Kawat       10         5.0             10
10      Kawat       10         5.0             10
11      Siput        3         5.0              1
12  Laba-laba        1         0.5              0

In [71]:
del df['Panjang']

In [72]:
df

         Nama  Bobot (Kg)  Status Bahaya
0   Laba-laba        15.0              5
1       Sanca        20.0              4
2         Boa        27.0              3
3       Kobra        14.0              2
4     Beludak        20.0              5
5     Tambang        21.0              1
6       Kawat         5.0             10
7       Kawat         5.0             10
8       Kawat         5.0             10
9       Kawat         5.0             10
10      Kawat         5.0             10
11      Siput         5.0              1
12  Laba-laba         0.5              0

In [73]:
df=df.drop(index=0)

In [74]:
df

         Nama  Bobot (Kg)  Status Bahaya
1       Sanca        20.0              4
2         Boa        27.0              3
3       Kobra        14.0              2
4     Beludak        20.0              5
5     Tambang        21.0              1
6       Kawat         5.0             10
7       Kawat         5.0             10
8       Kawat         5.0             10
9       Kawat         5.0             10
10      Kawat         5.0             10
11      Siput         5.0              1
12  Laba-laba         0.5              0